clc, clear all

t = 1000;
x = [];
y = [];
myRand = [];
u = 0;
for i=1:t
    x(i) = cos(0.5*u);
    myRand(i) = randn();
    y(i) = x(i) + myRand(i);
    u = u + 0.1;
end
plot(x);
hold on;
plot(y);

% фильтруем


%уравнение фильтрации
%расчет M

%расчет матрицы R
R = zeros(3,3);
G = max(myRand);%максмальное отклонение шума...хз как считать
R = [
        1/2 * cos(0)+G^2 , 1/2 * cos(0.5 *1 ) , 1/2 * cos(0.5 *2);
        1/2 * cos(0.5) , 1/2 * cos(0 )+G^2 , 1/2 * cos(0.5 *1);
        1/2 * cos(0.5 * 2)+G^2 , 1/2 * cos(0.5 *1 ) , 1/2 * cos(0)+G^2;
    ];
%расчет r
r = zeros(3);
r = [
    1/2 * cos(0.5);
    1/2 * cos(0);
    1/2 * cos(0.5);
];
%нахождение коэффициентов a(1:3)
a = zeros(3);
a = inv(R)*r;
%фильтрация
i=2;
x_2 = a(i-1)*y(i-1) + a(i)*y(i) + a(i+1)*y(i+1);%неправильный результат