%{
1. Сгенерировать данные, добавив к ним шум
2. Построить систему уравнений(уравнение для каждой точки)
3. Решить задачу МНК и получить коэффициенты полинома
4. Вывести график нашей функции и найденной функции
%}

N=500;
x1 = 0 ;
x2 = 10;
h = 0.01;
x = [];
y = [];
k = 0;
b = [2,3.5,188.1,-38.7]';
myF=@(x)(b(1) + b(2)*x + b(3)*x^2 + b(4)*x^3);
for i = 1:N
    x(i) = k;
    y(i) = myF(k) + randn()*0.1;
    k = k + h;
    
end
plot(x,y)

%строим матрицу X, B, Y
X = zeros(N,4);
B = [0,0,0,0];
Y = [];
k = 0;
for i = 1:N
    X(i,1:4) = [1,k,k^2,k^3];
    Y(i) = y(i);
    k = k + h;
end
Y = Y';
B = inv(X'*X)*X'*Y;
